[
  {
    "title": "Peak: Unleashing Your Inner Champion Through Revolutionary Methods for Skill Acquisition and Performance Enhancement in Work, Sports, and Life",
    "link": "https://www.amazon.com/Peak-Secrets-New-Science-Expertise-ebook/dp/B011H56MKS",
    "path": "images/books/Peak:_Unleashing_Your_Inner_Champion_Through_Revolutionary_Methods_for_Skill_Acquisition_and_Performance_Enhancement_in_Work,_Sports,_and_Life.jpg",
    "description": "\"Peak\" by Anders Ericsson presents a powerful and revolutionary learning strategy derived from three decades of research into the success modes of chess champions, violin virtuosos, star athletes, and memory mavens. Debunking common myths and presenting a science-based approach, the book offers a detailed roadmap to improving in various fields, from athletics and music to workplace efficiencies and academic achievement. With its actionable insights, this transformative guide offers practical applications to enhance any skill that matters to you, fostering continuous personal growth and achievement."
  },
  {
    "title": "Seven Pillars of Wisdom (Wordsworth Classics of World Literature)",
    "link": "https://www.amazon.com/Pillars-Wisdom-Wordsworth-Classics-Literature/dp/1853264695",
    "path": "images/books/Seven_Pillars_of_Wisdom_(Wordsworth_Classics_of_World_Literature).jpg",
    "description": ""
  },
  {
    "title": "System Design on AWS: Building and Scaling Enterprise Solutions",
    "link": "https://www.amazon.com/System-Design-AWS-Enterprise-Solutions/dp/1098146891",
    "path": "images/books/System_Design_on_AWS:_Building_and_Scaling_Enterprise_Solutions.jpg",
    "description": "\"Designing and Scaling Enterprise Software Architecture\" by Jayanth Kumar and Mandeep Singh is a practical guide to using AWS for building and scaling large-scale applications. This book provides software architects and engineers with essential knowledge of AWS and system design, offering insight into making the best decisions to overcome the associated challenges. Delving into specific use cases, it presents an understanding of how these principles and resources can be applied to real-world problems. Readers will learn the basics and best practices of system design, understand key AWS services, and explore engineering patterns that support large-scale systems. The book also provides information on how to design architecture with scalability, operations, and resilience in mind, and what performant and cost-optimized architectures on AWS look like, including the best tools and frameworks for specific use cases."
  },
  {
    "title": "The Narrow Road to the Deep North",
    "link": "https://www.amazon.com/Narrow-Road-Deep-North/dp/0804171475",
    "path": "images/books/The_Narrow_Road_to_the_Deep_North.jpg",
    "description": "A National Bestseller and Man Booker Prize winner, this powerful novel follows the life of Australian surgeon, Dorrigo Evans, through World War II and beyond. Haunted by a past affair, Dorrigo's daily existence becomes a battle for survival in a brutal Japanese POW camp on the Thai-Burma Death Railway. His life takes an unexpected turn when he receives a life-changing letter. This riveting tale explores themes of good and evil, truth, and transcendence as Dorrigo comes of age, achieves prosperity, and confronts the losses of his past. Now a Prime Video series directed by Justin Kurzel."
  }
]